In [1]:
#In order to work with a SQLite database from Python, we first have to connect to it. 
#We can do that using the connect function, which returns a Connection object:
import sqlite3
conn = sqlite3.connect("Courseera.db")

In [2]:
#Once we have a Connection object, we can then create a Cursor object. 
#Cursors allow us to execute SQL queries against a database:
cur = conn.cursor()

In [3]:
#We can Cursor Object to execute a query against the database with execute method

#Drop table INSTRUCTOR in case it already exists
cur.execute("DROP TABLE INSTRUCTOR;")

OperationalError: no such table: INSTRUCTOR

In [4]:
#Create table INSTRUCTOR
cur.execute("CREATE TABLE INSTRUCTOR(ins_id INTEGER, lastname VARCHAR(20), firstname VARCHAR(20), city VARCHAR(15), country VARCHAR(15));")

In [5]:
#Insert single row for Rav Ahuja
cur.execute("INSERT INTO INSTRUCTOR VALUES (1,'Ahuja','Rav','Toronto','CA');")
#Insert the two rows for Raul and Hima
cur.execute("INSERT INTO INSTRUCTOR VALUES (2,'Chong','Raul','Toronto','CA'),(3,'vasudevan','Hima','Chicago','US');")

In [6]:
# We can use the fetchall method to fetch all of the results of a query:
result=cur.execute("select * from INSTRUCTOR").fetchall()
print(result)

[(1, 'Ahuja', 'Rav', 'Toronto', 'CA'), (2, 'Chong', 'Raul', 'Toronto', 'CA'), (3, 'vasudevan', 'Hima', 'Chicago', 'US')]

In [9]:
#Reading results into a pandas DataFrame
import pandas as pd
df=pd.read_sql_query("select * from INSTRUCTOR;",conn)
df

   ins_id   lastname firstname     city country
0       1      Ahuja       Rav  Toronto      CA
1       2      Chong      Raul  Toronto      CA
2       3  vasudevan      Hima  Chicago      US

In [10]:
#Select firstname, lastname and country where city is Toronto
result=cur.execute("SELECT firstname,lastname from INSTRUCTOR WHERE city='Toronto'").fetchall()
print(result)

[('Rav', 'Ahuja'), ('Raul', 'Chong')]

In [15]:
#Change the city for Rav to Markham
cur.execute("UPDATE INSTRUCTOR SET city='Markham' where lastname='Ahuja' and firstname='Rav';")
df=pd.read_sql_query("select * from INSTRUCTOR;",conn)
df

   ins_id   lastname firstname     city country
0       1      Ahuja       Rav  Markham      CA
1       2      Chong      Raul  Toronto      CA
2       3  vasudevan      Hima  Chicago      US

In [16]:
#It's good practice to close Connection objects and Cursor objects.
#This prevents the SQLite database from being locked.
cur.close()
conn.close()